massi1993/MCU/libraries/stm32f3x_lib.h
/* STM32_F3X_LIB_H
*
*       Created on : June 01, 2022 
*           Author : massiAv
*
*/

#ifndef STM32_F3X_LIB_H
#define STM32_F3X_LIB_H

#include <stdint.h>



#define __vo            volatile                   /*!< The volatile keyword is intended to prevent 
                                                    the compiler from applying any optimizations on 
                                                    objects that can change in ways that cannot be 
                                                    determined by the compiler.
                                                    E.g. A variable can be modified by external 
                                                    interrupt.>*/    

#define FLASH_BASE      ((uint32_t)0x08000000)     /*!< FLASH base address in the alias region >*/

/*!-----------------------------------------------------------------------------

                    PROCESSOR SPECIFIC DETAILS: ARM CORTEX M4-PROCESSOR

-------------------------------------------------------------------------------->*/
 
/*!<  Structure type to access the Nested Vectored Interrupt Controller (NVIC) >*/

typedef struct
{
  __vo uint32_t ISER[8];                 /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register >*/
       uint32_t RESERVED0[24];
  __vo uint32_t ICER[8];                 /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register >*/
       uint32_t RSERVED1[24];
  __vo uint32_t ISPR[8];                 /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register >*/
       uint32_t RESERVED2[24];
  __vo uint32_t ICPR[8];                 /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register >*/
       uint32_t RESERVED3[24];
  __vo uint32_t IABR[8];                 /*!< Offset: 0x200 (R/W)  Interrupt Active bit Register >*/
       uint32_t RESERVED4[56];
  __vo uint8_t  IPR[240];                 /*!< Offset: 0x300 (R/W)  Interrupt Priority Register (8Bit wide) >*/
       uint32_t RESERVED5[644];
  __vo uint32_t STIR;                    /*!< Offset: 0xE00 ( /W)  Software Trigger Interrupt Register >*/
}  NVIC_Type;


                                         
/*!< define SCB Registers >*/
typedef struct
{
  __vo uint32_t CPUID;                   /*!< Offset: 0x000 (R/ )  CPUID Base Register                                   */
  __vo uint32_t ICSR;                    /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register                  */
  __vo uint32_t VTOR;                    /*!< Offset: 0x008 (R/W)  Vector Table Offset Register                          */
  __vo uint32_t AIRCR;                   /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register      */
  __vo uint32_t SCR;                     /*!< Offset: 0x010 (R/W)  System Control Register                               */
  __vo uint32_t CCR;                     /*!< Offset: 0x014 (R/W)  Configuration Control Register                        */
  __vo uint8_t  SHP[12];                 /*!< Offset: 0x018 (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) */
  __vo uint32_t SHCSR;                   /*!< Offset: 0x024 (R/W)  System Handler Control and State Register             */
  __vo uint32_t CFSR;                    /*!< Offset: 0x028 (R/W)  Configurable Fault Status Register                    */
  __vo uint32_t HFSR;                    /*!< Offset: 0x02C (R/W)  HardFault Status Register                             */
  __vo uint32_t DFSR;                    /*!< Offset: 0x030 (R/W)  Debug Fault Status Register                           */
  __vo uint32_t MMFAR;                   /*!< Offset: 0x034 (R/W)  MemManage Fault Address Register                      */
  __vo uint32_t BFAR;                    /*!< Offset: 0x038 (R/W)  BusFault Address Register                             */
  __vo uint32_t AFSR;                    /*!< Offset: 0x03C (R/W)  Auxiliary Fault Status Register                       */
  __vo uint32_t PFR[2];                  /*!< Offset: 0x040 (R/ )  Processor Feature Register                            */
  __vo uint32_t DFR;                     /*!< Offset: 0x048 (R/ )  Debug Feature Register                                */
  __vo uint32_t ADR;                     /*!< Offset: 0x04C (R/ )  Auxiliary Feature Register                            */
  __vo uint32_t MMFR[4];                 /*!< Offset: 0x050 (R/ )  Memory Model Feature Register                         */
  __vo uint32_t ISAR[5];                 /*!< Offset: 0x060 (R/ )  Instruction Set Attributes Register                   */
  __vo uint32_t RESERVED0[5];
  __vo uint32_t CPACR;                   /*!< Offset: 0x088 (R/W)  Coprocessor Access Control Register                   */
} SCB_Type;



/*!< define FLASH Registers >*/
typedef struct
{
  __vo uint32_t ACR;          /*!< FLASH access control register,              Address offset: 0x00 */
  __vo uint32_t KEYR;         /*!< FLASH key register,                         Address offset: 0x04 */
  __vo uint32_t OPTKEYR;      /*!< FLASH option key register,                  Address offset: 0x08 */
  __vo uint32_t SR;           /*!< FLASH status register,                      Address offset: 0x0C */
  __vo uint32_t CR;           /*!< FLASH control register,                     Address offset: 0x10 */
  __vo uint32_t AR;           /*!< FLASH address register,                     Address offset: 0x14 */
       uint32_t RESERVED;     /*!< Reserved, 0x18                                                   */
  __vo uint32_t OBR;          /*!< FLASH Option byte register,                 Address offset: 0x1C */
  __vo uint32_t WRPR;         /*!< FLASH Write register,                       Address offset: 0x20 */
  
} FLASH_TypeDef;



#define NVIC                    ((NVIC_Type*)0xE000E100U)   

#define SCB                     ((SCB_Type*) 0xE000E000U )   /*!< SCB configuration struct>*/  

#define PERIPH_BASE             ((uint32_t)0x40000000) /*!< Peripheral base address in the alias region */
#define AHB1PERIPH_BASE         (PERIPH_BASE + 0x00020000)
#define FLASH_R_BASE            (AHB1PERIPH_BASE + 0x00002000) /*!< Flash registers base address */
#define FLASH                   ((FLASH_TypeDef *) FLASH_R_BASE)

/*!< define macros for INTERRUPT REQUEST FOR STM32F3DISCOVERY - INTERRUPT VECTOR >*/
#define IRQ_NO_EXTI0            6
#define IRQ_NO_EXTI1            7
#define IRQ_NO_EXTI2            8
#define IRQ_NO_EXTI3            9
#define IRQ_NO_EXTI4            10
#define IRQ_NO_EXTI9_5          23
#define IRQ_TIM2                28
#define IRQ_TIM3                29
#define IRQ_TIM4                30
#define IRQ_SPI1                35
#define IRQ_SPI2                36
#define IRQ_NO_EXTI15_10        40
#define IRQ_SPI3                51
#define IRQ_TIM7                55


/*!-----------------------------------------------------------------------------

                                    FLASH                                   

-------------------------------------------------------------------------------->*/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                   ((uint8_t)0x03)               /*!< LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 ((uint8_t)0x01)               /*!< Bit 0 */
#define  FLASH_ACR_LATENCY_1                 ((uint8_t)0x02)               /*!< Bit 1 */

#define  FLASH_ACR_HLFCYA                    ((uint8_t)0x08)               /*!< Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                    ((uint8_t)0x10)               /*!< Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    ((uint8_t)0x20)  


/*!-----------------------------------------------------------------------------

                    DEFINE  STRUCT PERIPHERAL OF STM32F3DISCOVERY

-------------------------------------------------------------------------------->*/

/*!< define RCC REGISTERS >*/
typedef struct{
        __vo uint32_t CR;               /*!< its address is (RCC_base_address + 0x00) >*/                    
        __vo uint32_t CFGR;             /*!< its address is (RCC_base_address + 0x04) >*/
        __vo uint32_t CIR;              /*!< its address is (RCC_base_address + 0x08) >*/
        __vo uint32_t APB2RSTR;         /*!< its address is (RCC_base_address + 0x0C) >*/
        __vo uint32_t APB1RSTR;         /*!< its address is (RCC_base_address + 0x10) >*/        
        __vo uint32_t AHBENR;           /*!< its address is (RCC_base_address + 0x14) >*/   
        __vo uint32_t APB2ENR;          /*!< its address is (RCC_base_address + 0x18) >*/
        __vo uint32_t APB1ENR;          /*!< its address is (RCC_base_address + 0x1C) >*/   
        __vo uint32_t BDCR;             /*!< its address is (RCC_base_address + 0x20) >*/   
        __vo uint32_t CSR;              /*!< its address is (RCC_base_address + 0x24) >*/   
        __vo uint32_t AHBRSTR;          /*!< its address is (RCC_base_address + 0x28) >*/   
        __vo uint32_t CFGR2;             /*!< its address is (RCC_base_address + 0x2C) >*/
        __vo uint32_t CFGR3;             /*!< its address is (RCC_base_address + 0x30) >*/
}RCC_Type;


