massi1993/MCU/libraries/stm32f3x_lib.h
typedef struct{
       __vo uint32_t MODER;             /*!< its address is (GPIOx_base_address + 0x00) >*/
       __vo uint32_t OTYPER;            /*!< its address is (GPIOx_base_address + 0x04) >*/
       __vo uint32_t OSPEEDR;           /*!< its address is (GPIOx_base_address + 0x08) >*/
       __vo uint32_t PUPDR;             /*!< its address is (GPIOx_base_address + 0x0C) >*/
       __vo uint32_t IDR;               /*!< its address is (GPIOx_base_address + 0x10) >*/
       __vo uint32_t ODR;               /*!< its address is (GPIOx_base_address + 0x14) >*/
       __vo uint16_t BSR;               /*!< its address is (GPIOx_base_address + 0x18) >*/
       __vo uint16_t BRR;               /*!< its address is (GPIOx_base_address + 0x0A) >*/
}GPIO_Type;


typedef struct{
      __vo uint32_t CFGR1;              /*!< its address is (SYSCFG_base_address + 0x00) >*/
      __vo uint32_t RCR;                /*!< its address is (SYSCFG_base_address + 0x04) >*/
      __vo uint32_t EXTICR[4];          /*!< its address is (SYSCFG_base_address + 0x08) >*/
      __vo uint32_t CFGR2;              /*!< its address is (SYSCFG_base_address + 0x14) >*/
 }SYSCFG_Type;



typedef struct{
      __vo uint32_t IMR;               /*!< its address is (EXTI_base_address + 0x00) >*/
      __vo uint32_t EMR;               /*!< its address is (EXTI_base_address + 0x04) >*/
      __vo uint32_t RTSR;              /*!< its address is (EXTI_base_address + 0x08) >*/
      __vo uint32_t FTSR;              /*!< its address is (EXTI_base_address + 0x0C) >*/
      __vo uint32_t SWIER;             /*!< its address is (EXTI_base_address + 0x10) >*/
      __vo uint32_t PR;                /*!< its address is (EXTI_base_address + 0x14) >*/
 }EXTI_Type;


typedef struct {
      __vo uint32_t CR1;                /*!< its address is (TIMER_base_address + 0x00) >*/
      __vo uint32_t CR2;                /*!< its address is (TIMER_base_address + 0x04) >*/
      __vo uint32_t SMCR;               /*!< its address is (TIMER_base_address + 0x08) >*/
      __vo uint32_t DIER;               /*!< its address is (TIMER_base_address + 0x0C) >*/
      __vo uint32_t SR;                 /*!< its address is (TIMER_base_address + 0x10) >*/
      __vo uint32_t EGR;                /*!< its address is (TIMER_base_address + 0x14) >*/
      __vo uint32_t CCMR1;              /*!< its address is (TIMER_base_address + 0x18) >*/
      __vo uint32_t CCMR2;              /*!< its address is (TIMER_base_address + 0x1C) >*/
      __vo uint32_t CCER;               /*!< its address is (TIMER_base_address + 0x20) >*/
      __vo uint32_t CNT;                /*!< its address is (TIMER_base_address + 0x24) >*/
      __vo uint32_t PSC;                /*!< its address is (TIMER_base_address + 0x28) >*/
      __vo uint32_t ARR;                /*!< its address is (TIMER_base_address + 0x2C) >*/
      __vo uint32_t RESERVED1;          /*!< its address is (TIMER_base_address + 0x30) -> RESERVED >*/
      __vo uint32_t CCR1;               /*!< its address is (TIMER_base_address + 0x34) >*/
      __vo uint32_t CCR2;               /*!< its address is (TIMER_base_address + 0x38) >*/
      __vo uint32_t CCR3;               /*!< its address is (TIMER_base_address + 0x3C) >*/
      __vo uint32_t CCR4;               /*!< its address is (TIMER_base_address + 0x40) >*/
      __vo uint32_t RESERVED2;          /*!< its address is (TIMER_base_address + 0x44) -> RESERVED >*/
      __vo uint32_t DCR;                /*!< its address is (TIMER_base_address + 0x48) >*/
      __vo uint32_t DMAR;               /*!< its address is (TIMER_base_address + 0x4C) >*/
}TIMER_Type;



/*!< define of peripheral base address >*/
#define RCC             ((RCC_Type*)    0x40021000U)
#define GPIOE           ((GPIO_Type*)   0x48001000U)
#define GPIOA           ((GPIO_Type*)   0x48000000U)
#define TIM2            ((TIMER_Type*)  0x40000000U)
#define TIM3            ((TIMER_Type*)  0x40000400U)
#define EXTI            ((EXTI_Type*)   0x40010400U)
#define SYSCFG          ((SYSCFG_Type*) 0x40010000U)

/*!< define MACROS of GPIOx_EN into RCC_AHBENR >*/
#define GPIOA_EN                (1<<17)
#define GPIOB_EN                (1<<18)
#define GPIOC_EN                (1<<19)
#define GPIOD_EN                (1<<20)
#define GPIOE_EN                (1<<21)
#define GPIOF_EN                (1<<22)

/*!-----------------------------------------------------------------------------

                          Reset and Clock Control                            
                                                                        
-------------------------------------------------------------------------------->*/

/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        ((uint32_t)0x00000001)
#define  RCC_CR_HSIRDY                       ((uint32_t)0x00000002)

#define  RCC_CR_HSITRIM                      ((uint32_t)0x000000F8)
#define  RCC_CR_HSITRIM_0                    ((uint32_t)0x00000008)/*!<Bit 0 */
#define  RCC_CR_HSITRIM_1                    ((uint32_t)0x00000010)/*!<Bit 1 */
#define  RCC_CR_HSITRIM_2                    ((uint32_t)0x00000020)/*!<Bit 2 */
#define  RCC_CR_HSITRIM_3                    ((uint32_t)0x00000040)/*!<Bit 3 */
#define  RCC_CR_HSITRIM_4                    ((uint32_t)0x00000080)/*!<Bit 4 */

#define  RCC_CR_HSICAL                       ((uint32_t)0x0000FF00)
#define  RCC_CR_HSICAL_0                     ((uint32_t)0x00000100)/*!<Bit 0 */
#define  RCC_CR_HSICAL_1                     ((uint32_t)0x00000200)/*!<Bit 1 */
#define  RCC_CR_HSICAL_2                     ((uint32_t)0x00000400)/*!<Bit 2 */
#define  RCC_CR_HSICAL_3                     ((uint32_t)0x00000800)/*!<Bit 3 */
#define  RCC_CR_HSICAL_4                     ((uint32_t)0x00001000)/*!<Bit 4 */
#define  RCC_CR_HSICAL_5                     ((uint32_t)0x00002000)/*!<Bit 5 */
#define  RCC_CR_HSICAL_6                     ((uint32_t)0x00004000)/*!<Bit 6 */
#define  RCC_CR_HSICAL_7                     ((uint32_t)0x00008000)/*!<Bit 7 */

